vim.vim Git.Git GitHub.GitHubDesktop BlenderFoundation.Blender Mozilla.Firefox FreeCAD.FreeCAD Ultimaker.Cura AutoHotkey.AutoHotkey OpenWhisperSystems.Signal Valve.Steam KiCad.KiCad Microsoft.PowerShell GIMP.GIMP Inkscape.Inkscape VideoLAN.VLC yt-dlp.yt-dlp Gyan.FFmpeg HandBrake.HandBrake PrismLauncher.PrismLauncher CPUID.HWMonitor Discord.Discord Wacom.WacomTabletDriver

non elevated:
Spotify.Spotify 

manual install required:
solid edge
cad assistant

winget install --no-upgrade --silent --accept-source-agreements --accept-package-agreements
$addPath = 'C:\Program Files\Vim\vim91'

# programs windows 
blender
freecad
solidedge
fusion 360
ansys
7-zip
altdrag
apple driver for icloud bookmarks firefox
arduino ide
audacity
autohotkey editor
brother printer driver
discord
ffmpeg
gimp
git
inkscape
java
kicad
krita
libreoffice suite
logitech g hub
visual studio
firefox
thunderbird
powertoys
python
signal
spotify
steam
cura
united states (international alternate)
wacom tablet driver/software
gvim
